[
    {
        "category": "Full-Stack Developer",
        "image": "https://i.ibb.co/9n0Dqsn/309510838-784679859266900-3551682852037409281-n.jpg",
        "title": "Full-Stack Web Development with React Specialization",
        "title_other": "Build Complete Web and Hybrid Mobile Solutions. Master front-end web, hybrid mobile app and server-side development in three comprehensive courses.",
        "instructor": "Jogesh K. Muppala",
        "skills": "Bootstrap, Node.js, Jquery, SASS, MongoDB, Express.js,Authentication",
        "about": "The first two courses in this Specialization cover front-end frameworks: Bootstrap 4 and React. On the server side, you’ll learn to implement NoSQL databases using MongoDB, work within a Node.js environment and Express framework, and communicate to the client side through a RESTful API. Learners enrolling in this Specialization are expected to have prior working knowledge of HTML, CSS and JavaScript.",
        "ratings": "4.5",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approximately 3 months to complete",
        "language": "English",
        "Price": 99
    },
    {
        "category": "Front-End Developer",
        "image": "https://i.ibb.co/QJTMvfY/312453398-647876886854848-3955212219669554691-n.jpg",
        "title": "Front-End Web Development with React",
        "title_other": " familiar with client-side Javascript application development and the React library",
        "instructor": "Jogesh K. Muppala",
        "skills": "React , React Router and Single Page Applications,More Redux and Client-Server Communication",
        "about": "TThis course explores Javascript based front-end application development, and in particular the React library (Currently Ver. 16.3). This course will use JavaScript ES6 for developing React application. You will also get an introduction to the use of Reactstrap for Bootstrap 4-based responsive UI design. ",
        "ratings": "4.8",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approx. 36 hours to complete",
        "language": "English",
        "Price": 99
    },
    {
        "category": "Basic Courses",
        "image": "https://i.ibb.co/TLhp8xN/305870475-5787671647921153-5230283289030689951-n.jpg",
        "title": "Design and Develop a Website using Figma and CSS",
        "title_other": "Basic tools and features of Figma, design a website’s prototype and convert it into a website exactly as designed, using HTML and CSS.",
        "instructor": "Md Farhad Ali",
        "skills": "Graphic Designing, Web Design, Vector Graphics, Prototype Creation",
        "about": "In this 2-hour long project-based course, you will learn how to use the basic tools and features of Figma, design a website’s prototype and convert it into a website exactly as designed, using HTML and CSS.",
        "ratings": "4.5",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approximately 2 Hours to complete",
        "language": "English",
        "Price": 120
    },
    {
        "category": "Mobile Apps",
        "image": "https://i.ibb.co/R7L8gSk/308449029-1229597977601614-7593462290109273689-n.jpg",
        "title": "Build Your First Android App (Project-Centered Course)",
        "title_other": "Build Your First Android App with React Native",
        "instructor": "Dr. Virginie Galtier",
        "skills": "Install Tools, Create HelloWorld App, Toward Your Application, Step-By-Step",
        "about": "In this project-centered course*, you’ll design, build, and distribute your own unique application for the Android mobile platform. We’ll provide you with a set of customizable building blocks that you can assemble to create many different types of apps, and that will help you become familiar with many important specificities of Android development. When you complete the project, in addition to having a personalized app that you can use and share, you’ll have the skills and background you need to move on to more advanced coursework in Android development.",
        "ratings": "4.5",
        "certificate": "ShareableCertificate",
        "level": "Beginner Level",
        "duration": "Approx. 22 hours to complete",
        "language": "English",
        "Price": 99
    },
    {
        "category": "Basic Courses",
        "image": "https://i.ibb.co/qncrrhc/310959560-822409735550675-5891700492562888901-n.jpg",
        "title": "Work Smarter with Microsoft Word",
        "title_other": "Knowing how to use Microsoft Office products is essential in any professional setting.",
        "instructor": "Bray Belley",
        "skills": "You will learn how to create and maintain professional-looking reports, multi-column newsletters, résumés, and business correspondence.",
        "about": "This course is intended for learners with some experience using Microsoft Windows, who are seeking to build presentation skills with Microsoft Word. To be successful in this course you should have an understanding of the basics of using a Windows-based computer. Experience with printing and using a web browser are an asset, but not required.",
        "ratings": "4.2",
        "certificate": "OnlineCertificate",
        "level": "Beginner Level",
        "duration": "Approximately 3 months to complete",
        "language": "English",
        "Price": 35
    },
    {
        "category": "Front-End Developer",
        "image": "https://i.ibb.co/KrdyCrP/307442764-986554439404941-677150973465277753-n.jpg",
        "title": "Build a Facebook Clone with PHP",
        "title_other": "Develop a web application as well as you will learn and understand the working principle of Facebook. ",
        "instructor": "K Herry",
        "skills": "Designing Database,create a login form, Display user's information ",
        "about": "In this project, you will learn how to set up the development process of a web application, how to design and style a web page, connect a web page into a back-end database and insert information into a database.By the end of this project, you will be able to develop a clone of any web application.",
        "ratings": "4.5",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approximately 1 month to complete",
        "language": "English",
        "Price": 49
    },
    {
        "category": "Node.js",
        "image": "https://i.ibb.co/4K3w1p2/309834553-349319204057065-5710614490041793197-n.jpg",
        "title": "Server-side Development with NodeJS, Express and MongoDB",
        "title_other": "This course deals with all things server-side.",
        "instructor": "Joseph",
        "skills": "Node.Js, Mongodb, Express.Js ",
        "about": "We base the entire course around the NodeJS platform. We start with a brief overview of the Web protocols: HTTP and HTTPS. We examine NodeJS and NodeJS modules: Express for building web servers. On the database side, we review basic CRUD operations, NoSQL databases, in particular MongoDB and Mongoose for accessing MongoDB from NodeJS. ",
        "ratings": "4.5",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approximately 3 months to complete",
        "language": "English",
        "Price": 99
    },
    {
        "category": "Front-End Developer",
        "image": "https://i.ibb.co/t2mrHP9/307233885-1463901927449992-517603538971305756-n.jpg",
        "title": "HTML, CSS, and Javascript for Web Developers",
        "title_other": "we will learn the basic tools that every web page coder needs to know.",
        "instructor": "Yakub chaikkin",
        "skills": "Introduction to HTML5, Introduction to CSS3,Coding the Static Restaurant Site,Introduction to Javascript",
        "about": "o you realize that the only functionality of a web application that the user directly interacts with is through the web page? Implement it poorly and, to the user, the server-side becomes irrelevant! Today’s user expects a lot out of the web page: it has to load fast, expose the desired service, and be comfortable to view on all devices: from a desktop computers to tablets and mobile phones.",
        "ratings": "4.5",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approximately 3 months to complete",
        "language": "English",
        "Price": 25
    },
    {
        "category": "Basic Courses",
        "image": "https://i.ibb.co/w7HR0Bw/312355351-1300242087442961-6852299434046850175-n.jpg",
        "title": "Excel Skills for Business Specialization",
        "title_other": "Learn Excel Skills for Business. Master Excel to add a highly valuable asset to your employability portfolio.",
        "instructor": "Nicky Bull",
        "skills": "Be comfortable navigating the Excel user interface, entering, manipulating and formatting data.",
        "about": "The best way to learn Excel is to use Excel. In this specialization, learners will solve a broad range of business problems as they apply the Excel skills and techniques they learn along the way. This specialization uses downloadable Excel workbooks and full data sets with applied examples and practical challenge exercises. This provides learners with countless opportunities to practice their Excel skills while discovering new and useful productivity features of Excel for a variety of business contexts.",
        "ratings": "4.1",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approximately 3 months to complete",
        "language": "English",
        "Price": 65
    },
    {
        "category": "Type Script",
        "image": "https://i.ibb.co/gvbbvM4/306733533-447217714163278-2040563074843795419-n.jpg",
        "title": "Typescript in React: Get started",
        "title_other": "Convert some simple React components into valid Typescript components",
        "instructor": "Nicky Bull",
        "skills": "JavaScript, Typescript, React (Web Framework)",
        "about": "In this course we will work with a number of examples of react components to work our way logically through some of the most commonly used parts of typescript in React. Along the way, feel free to pause the videos at any point and really play with the code to test things out, hover things and try to see if you can use the tooling to find solutions to the problems we have. By the end of the course you will be able to start working with a Typescript project in a React application.",
        "ratings": "4.1",
        "certificate": "ShareableCertificate",
        "level": "Intermediate Level",
        "duration": "Approximately 3 months to complete",
        "language": "English",
        "Price": 199
    }
]